app/Controllers/Room.php

SELECT *
FROM `rooms`
ORDER BY `created_at` DESC
---
    public function index()
    {
        $model = new RoomModel();
        $data['rooms'] = $model->findAll();