app/Controllers/Staff.php

    public function add_form_details()
    {
        helper(['form', 'url']);
        $response = ['success' => false, 'message' => ''];
        // input validation
        if (
            !$this->validate([
                'fullname' => 'required|min_length[3]',
                'empid' => 'required|max_length[8]',
                'email' => 'required|valid_email',
                'mobile' => 'required|exact_length[10]',
                'post' => 'required',
            ])
        ) {
            $response['message'] = implode(', ', $this->validator->getErrors());
            return $this->response->setJSON($response);
        }
        // Process and save the data
        $model = new StaffModel();
        $data = [
            'fullname' => $this->request->getPost('fullname'),
            'empid' => $this->request->getPost('empid'),
            'email' => $this->request->getPost('email'),
            'mobile' => $this->request->getPost('mobile'),
            'post' => $this->request->getPost('post'),
        ];
        if ($model->save($data)) {
---
INSERT INTO `staff` (`fullname`, `empid`, `email`, `mobile`, `post`) VALUES ('Prachi', 'EMP20240006', 'prachi@gmail.com', '8851734531', 'HR')