app/Controllers/Staff.php

SELECT *
FROM `staff`
ORDER BY `created_at` DESC
---
    public function index()
    {
        $model = new StaffModel();
        $data['staff'] = $model->orderBy('created_at', 'DESC')->findAll(); // Fetch all staff records

SELECT *
FROM `staff`
WHERE `empid` LIKE 'EMP2024%'
ORDER BY `empid` DESC
 LIMIT 1
---
    private function generate_unique_empid()
    {
        $model = new StaffModel();
        $year = date('Y'); // Get the current year

        // Get the last employee ID of the current year
        $lastEmpId = $model->where('empid LIKE', "EMP$year%")->orderBy('empid', 'DESC')->first();

DELETE FROM `staff`
WHERE `id` IN ('90')
---
    public function delete_staff($id)
    {
        $model = new StaffModel();

        if ($model->delete($id)) {